trade_exp/src/InformationRegisters/ОчередьПечати/ОчередьПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9112ea84-7dc7-4182-bb49-2c3e836fb5a6">
  <name>ОчередьПечати</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <attributes extendedConfigurationObject="1ce5b02d-eb35-44a0-8011-ac8aae60062d">
    <name>Пробить</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="d5132623-b887-4f1b-8023-9a8bae1e1d06">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c15c25ae-ff6d-4664-ba09-66c59928d787">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ВидыОперацийЛистовСогласования/ВидыОперацийЛистовСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4e174d0c-fcf4-4edb-b771-d537842fb500">
  <name>ВидыОперацийЛистовСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0d0f242a-48ae-475d-ad76-05749bd4f77a">
    <name>СогласованиеТранзитов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="462fe71b-3cb9-4c1c-9888-bdb3e6556265">
    <name>СогласованиеЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="37f89f9f-becc-4e83-9791-d21c6238816b">
    <name>СогласованиеОформления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЛистСогласования/ЛистСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЛистСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bd7ea247-d70a-4d92-8cd1-47dd38150946">
    <name>ЗадолженностьПоДоговору</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3512a52c-9acd-45aa-804a-ca5be089f33f">
    <name>ЗадолженностьПоПартнеру</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0bc5285-0919-4f85-a76a-917121dc97f7">
    <name>Проблема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89f1256b-558f-47e6-9ac4-50effd1ea3da">
    <name>ДатаИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e3352f3-d5d8-490e-bf93-180010c0e2bc">
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2aa8b804-d300-40d4-8612-ffc4be650575">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ea323fd-1fd1-401c-8754-d23f642bbee1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e25d6271-38c5-420f-857c-1046650bddb2">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eb42b1f-fbbe-48cd-b72e-a17e84f5b3fd">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2969a8aa-a5b3-4ce7-81b3-c196f690ff12">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2664f229-27c5-4ab7-bdcc-6e1f12591738">
    <name>Исполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79deed0e-4a1e-4e98-abff-d97cca969ea3">
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd483cea-3167-4be8-9a7b-907195fed864">
    <name>ОплатаДо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a82a6d7e-91c4-476b-846d-35797a773436">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c21d35e3-631d-41e4-97ad-6641158d01f1">
    <name>Согласователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64f86b4c-7d54-46b4-ac7a-f66b7c8a4ed3">
    <name>ДатаРегистрацииИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61d8cf96-a87b-4b3f-82bd-f47b88a0a6b2">
    <name>ДатаРегистрацииСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9696be9-259d-48d2-acae-a488245743b7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7a11fe18-5ed9-4686-81a4-2c953068f858">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0e10f187-eed8-4a74-ad3f-41977c655684">
    <name>ОстатокДоступногоЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1a49d888-bd7f-4334-8ff8-e93a57cb570a">
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="526eac68-cb4b-4908-bc13-1a77e20acbf6">
    <name>Аннулирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc47dd80-4fa8-4382-85cc-0bb2a6ea2344">
    <name>ДатаРегистрацииАннулирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb1f6b46-b63a-41b8-be2a-95d8f14c5069">
    <name>ПользовательАннулировал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="061685f0-091a-457d-9c28-92025f6c5b4f">
    <name>СуммаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0bf38673-8ec2-4f32-8979-463fb5698aa6">
    <name>ДокументыСданы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0147949-9ac7-484e-a0ca-8b34f672cff8">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="164c893d-909d-49d8-a7ba-800c18b6d039">
    <name>ДатаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f4b22395-72bb-4776-b524-cfb53c57a4f4">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="550c31a7-7fbc-4734-a07f-2c1c7740b581">
    <name>АвторДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ad8094-987b-4a04-be24-8dfc5c80007b">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="233e2c0e-f8f8-4b89-8226-26d79824c73b">
    <name>ТелефонВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9d617b0f-530e-468c-9892-04f5cb814fd8">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67a5e386-695b-4a2d-b797-85e8575cd0d9">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adf90053-7b0e-4c0c-b68f-dea98e3d5512">
    <name>ЗакрывающийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b202c1c5-6f08-4c5a-a971-994b3a823381">
    <name>ПричинаАнулирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f48d72a7-688f-4060-9471-78ce17ef6985">
    <name>ДокументыСданыКомментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="651738b7-f1d8-42b6-8715-ecf95d1cf2e6">
    <name>СогласованиеПросроченнойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1bc5b57-b12c-4d9d-8031-2f2f4a41c589">
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4441e03a-af91-4f94-b3af-ef3e1da779c9">
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="311a625c-24d8-4904-b476-ab8a851af32e">
    <name>ДатаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af9eb79a-5875-48dd-a78f-f6b647d35e28">
    <name>СчетФактура</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="29b69425-b470-40ba-a4e7-ccf20f0881a0">
    <name>ОтправленоСогласователю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb028d7b-43a8-477f-9304-ad8ecc5530a4">
    <name>ДатаПередачиВБухгалтерию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1900bbe4-7fbe-47c9-9810-e3bd898afe33">
    <name>СтатусЛистаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ce52be8e-dbd2-4c4b-b7a7-611e5ca5521c">
    <name>ЕстьМаркированныйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a9084dcf-265d-4098-820d-eccd4153f5d6">
    <name>ОтправленоМенеджеру</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="07c7c64e-3afa-4b32-b3c3-4aca4478e4e0">
    <name>Проблемы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="78b64a6c-b2f2-484c-8326-b668f1343f0e">
      <name>ПроблемаРасшифровка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6bf3592f-8fd6-4297-970c-6377faa8eec4">
      <name>Выполнено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f315772c-11c4-4d38-86f9-344a698693fe">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/HTTPServices/ОбменСМобильнымПриложениемВодителей/Module.bsl
#Область Маршруты
Функция MobDeliveryEcho(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Метод= ПолучитьМетод(Запрос);
	
	Ответ.УстановитьТелоИзСтроки("Всё ОК! Метод: "+Метод, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
КонецФункции

Функция MobDeliveryОбмен(Запрос)
	УстановитьПривилегированныйРежим(Истина);  
	
	Если Константы.ИспользоватьОбработчикМетодаСервисаМобильногоПриложения.Получить() Тогда
	
		ДанныеJSON= Запрос.ПолучитьТелоКакСтроку("UTF-8");
		
		Метод= ПолучитьМетод(Запрос);
		
		//Маршрутизация
		Если Метод = "/Registration" Тогда
			ОтветHTTP= Registration(ДанныеJSON);
			
		ИначеЕсли Метод = "/ConfirmRegistration" Тогда
			ОтветHTTP= ConfirmRegistration(ДанныеJSON);
			
		ИначеЕсли Метод = "/Exchange" Тогда
			ОтветHTTP= Exchange(ДанныеJSON);
			
		ИначеЕсли Метод = "/Print" Тогда
			ОтветHTTP= Print(ДанныеJSON);
			
		ИначеЕсли Метод = "/Pay" Тогда
			ОтветHTTP= Pay(ДанныеJSON);		
			
		Иначе
			ОтветHTTP= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Передан неверный метод");
		КонецЕсли;
		
		Возврат ОтветHTTP; 
		
	Иначе 
		ОтветHTTP= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Сервис перенесен в приложение ЯндексКурьер. Для работы необходимо скачать и установить указанное приложение");
		Возврат ОтветHTTP;
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#Область ОбработкаМаршрутов
Функция Registration(ДанныеJSON)
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
		
		Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получена пустая структура");
			Возврат Ответ;
		КонецЕсли;
		
		Если ПустаяСтрока(ВходящиеДанные.Телефон) Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан телефон");
			Возврат Ответ;
		КонецЕсли;
		
		Если СтрДлина(ВходящиеДанные.Телефон) <> 10 Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Телефон должен быть 10 цифр");
			Возврат Ответ;
		КонецЕсли;		
		
		//Получаем водителя
		Водитель= АльтерраОбщегоНазначения.ПолучитьВодителяПоТелефону(ВходящиеДанные.Телефон);
		Если Не ЗначениеЗаполнено(Водитель) Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не обноружен водитель с таким номером в базе 1С");
			Возврат Ответ;
		КонецЕсли;
		
		//Пробуем без этого
		//Если Не ПустаяСтрока(Водитель.ИдентификаторМобильногоПриложения) Тогда
		//	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Телефон уже зарегестрирован");
		//	Возврат Ответ;
		//КонецЕсли;
		
		//Делаем проверку кода
		Если ВходящиеДанные.ЭтоТестовыйРежим Тогда
			КодОтправленный= "555";
		Иначе
			КодОтправленный= ОтправитьКодПодтверждения(ВходящиеДанные.Телефон);
		КонецЕсли;
		Если ПустаяСтрока(КодОтправленный) Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не удалось сгенерировать код подтверждения");
			Возврат Ответ;
		КонецЕсли;
		
		Данные= Новый Структура("КодПодверждения", КодОтправленный);
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь, "Отправлен СМС скодом подтверждения", Данные);
		Возврат Ответ;			
		
	Исключение
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не удалось отправить код подтверждения");
		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось отправить код подтверждения");
		Возврат Ответ;			
	КонецПопытки;
КонецФункции

Функция ConfirmRegistration(ДанныеJSON)
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
		
		Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
			Возврат Ответ;
		КонецЕсли;
		
		Если ПустаяСтрока(ВходящиеДанные.КодПодтверждения) Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан код подтверждения");
			Возврат Ответ;
		КонецЕсли;
		
		Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
			Возврат Ответ;
		КонецЕсли;			
		
		//Получаем водителя
		Водитель= АльтерраОбщегоНазначения.ПолучитьВодителяПоТелефону(ВходящиеДанные.Телефон);
		Если Не ЗначениеЗаполнено(Водитель) Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не обноружен водитель с таким номером в базе 1С");
			Возврат Ответ;
		КонецЕсли;
		
		//Если Не ПустаяСтрока(Водитель.ИдентификаторМобильногоПриложения) Тогда
		//	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Телефон уже зарегестрирован");
		//	Возврат Ответ;
		//КонецЕсли;
		
		//Делаем проверку кода
		Если ВходящиеДанные.КодПодтверждения <> ВходящиеДанные.КодОтправленный Тогда
			Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Неверный код подтверждения");
			Возврат Ответ;	
		КонецЕсли;
		
		
		//Регистрация
		НачатьТранзакцию();
		
		ОбнаруженыОшибки= Ложь;
		ВодительОбъект= Водитель.ПолучитьОбъект();
		ВодительОбъект.ИдентификаторМобильногоПриложения= ВходящиеДанные.ИдентификаторКлиента;
		ВодительОбъект.Записать();
		
		ВходящиеДанные.Вставить("Сотрудник", ВодительОбъект.Ссылка);
		
		//Ответ= ПланыОбмена.МобильноеПриложениеВодителей.ИнициализацияУзлаМобильногоУстройства(ВходящиеДанные);
		//Если Ответ.Ошибка Тогда
		//	ОбнаруженыОшибки= Истина;
		//КонецЕсли;
		
		УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.ИнициализацияУзлаМобильногоУстройства(ВходящиеДанные);
		Если УзелВодителя = Неопределено Тогда
			ОбнаруженыОшибки= Истина;
		КонецЕсли;		
		
		//Зарегестрируем к обмену начальные данные
		ПланыОбмена.МобильноеПриложениеВодителей.ЗарегестрироватьКОбменуНачальныеДанные(УзелВодителя);
	Исключение
		ОбнаруженыОшибки= Истина;
	КонецПопытки;
	
	Если ОбнаруженыОшибки Тогда
		ОтменитьТранзакцию();
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не удалось зарегестрировать телефон");
		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось зарегестрировать телефон");
		Возврат Ответ;			
	Иначе
		ЗафиксироватьТранзакцию();
		
		Данные= Новый Структура;
		Данные.Вставить("Подразделение", Водитель.Подразделение.Наименование);
		Данные.Вставить("Водитель", Водитель.Наименование);
		
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь, "Телефон успешно зарегестрирован", Данные);
		Возврат Ответ;
	КонецЕсли;
КонецФункции

Функция Exchange(ДанныеJSON)
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	//ПОЛУЧЕНИЕ
	ПланыОбмена.МобильноеПриложениеВодителей.ПринятьПакет1СДанными(ВходящиеДанные, Отказ);
	//ОТПРАВКА
	ДанныеКОтправке= ПланыОбмена.МобильноеПриложениеВодителей.ПодготовитьПакет1СКОтправке(ВходящиеДанные.ИдентификаторКлиента, Отказ);
	
	Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь, "Обмен выполнен успешно", ДанныеКОтправке);
	Возврат Ответ;
	
	//Исключение
	//Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не удалось выполнить обмен");
	//ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , ИнформацияОбОшибке().Описание, "Не удалось выполнить обмен");
	//Возврат Ответ;			
	//КонецПопытки;
КонецФункции

Функция Print(ДанныеJSON)
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	Если Не ВходящиеДанные.Свойство("Ссылка") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передана ссылка на документ");
		Возврат Ответ;
	КонецЕсли;
	
	Ссылка= ВходящиеДанные.Ссылка;
	УИД= Новый УникальныйИдентификатор(Ссылка);
	Документ= Документы.ЗаданиеНаПеревозкуРейс.ПолучитьСсылку(УИД);
	
	Если Документ.Пустая() Тогда 
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Документ не найден в центральной базе");
		Возврат Ответ;
	КонецЕсли;
	
	Сотрудник= Справочники.Сотрудники.ПолучитьВодителяПоИдентификатору(ВходящиеДанные.ИдентификаторКлиента);
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не найден водитель");
		Возврат Ответ;
	КонецЕсли;
	
	Рейс= АльтерраОбщегоНазначения.ПолучитьПодготовленныйРейс(Сотрудник, Перечисления.СтатусыРейсов.ДокументыНаПогрузкуГотовы);
	
	Если Документ <> Рейс Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Нет подготовленных документов к печати");
		Возврат Ответ;
	КонецЕсли;
	
	Если НачалоДня(Документ.ВремяВыезда) <> НачалоДня(ТекущаяДата()) Тогда 
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Дата выезда рейса не подошла");
		Возврат Ответ;
	Иначе
		РегистрыСведений.ОчередьПечати.ДобавитьВОчередь(Документ);
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь, "Документ отправлен на печать");
		Возврат Ответ;
	КонецЕсли;
КонецФункции

Функция Pay(ДанныеJSON)
	Отказ= Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
	ВходящиеДанные= ОбщийHTTPСервер.ДесериализоватьИзJSON(ДанныеJSON);
	
	Если ТипЗнч(ВходящиеДанные) <> Тип("Структура") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Получина пустая структура");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПустаяСтрока(ВходящиеДанные.ИдентификаторКлиента) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передан идентификатор клиента");
		Возврат Ответ;
	КонецЕсли;
	
	Если Не ВходящиеДанные.Свойство("Ссылка") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передана ссылка на документ");
		Возврат Ответ;
	КонецЕсли;
	
	Если Не ВходящиеДанные.Свойство("СуммаОплаты") Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не передана сумма оплаты");
		Возврат Ответ;
	КонецЕсли;
	
	
	Сотрудник= Справочники.Сотрудники.ПолучитьВодителяПоИдентификатору(ВходящиеДанные.ИдентификаторКлиента);
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Не найден водитель");
		Возврат Ответ;
	КонецЕсли;
	
	Ссылка= ВходящиеДанные.Ссылка;
	СуммаОплаты= ВходящиеДанные.СуммаОплаты;
	
	Если СуммаОплаты = 0 Тогда 
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Сумма оплаты равна нулю");
		Возврат Ответ;
	КонецЕсли;
	
	УИД= Новый УникальныйИдентификатор(Ссылка);
	ЗаказНаДоставку= Документы.ЗаказНаДоставкуКлиенту.ПолучитьСсылку(УИД);

	Если Не ЗначениеЗаполнено(ЗаказНаДоставку) ИЛИ ЗаказНаДоставку.Пустая() Тогда 
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Документ не найден в центральной базе");
		Возврат Ответ;
	КонецЕсли;
	
	Адрес= ЗаказНаДоставку.Подразделение.КассаДоставка.IP;
	Порт= ЗаказНаДоставку.Подразделение.КассаДоставка.Порт;
	ИДУстройства= ЗаказНаДоставку.Подразделение.КассаДоставка.ИДУстройства;
	
	ПараметрыПодключения= АТОЛСревер.ПолучитьПараметрыСоединения(Адрес, Порт, , , Ложь, ИДУстройства);
	
	ПараметрыАТОЛ= АТОЛСревер.ШаблонПараметровАТОЛ();
	ПараметрыАТОЛ.ПараметрыПодключения= ПараметрыПодключения;
	ПараметрыАТОЛ.ИДУстройства= ПараметрыПодключения.ИДУстройства;
	ПараметрыАТОЛ.Кассир= ЗаказНаДоставку.Подразделение.КассаДоставка.Кассир;
	ПараметрыАТОЛ.НеПечататьЧек= ЗаказНаДоставку.Подразделение.КассаДоставка.НеПечататьЧек;
	ПараметрыАТОЛ.СуммаОплаты= СуммаОплаты;
	
	
	//Информация о кассовой смене
	ИнформацияОКассовойСмене= АТОЛСревер.ИнформацияОКассовойСмене(ПараметрыАТОЛ);
	Если ИнформацияОКассовойСмене.state = "expired" Тогда
		Текст= "Истек срок открытия кассовой смены";
		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителейОплата", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Сотрудник, Текст, );
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, Текст);
		Возврат Ответ;
	КонецЕсли;
	//ПараметрыАТОЛ.ИнформацияОКассовойСмене= ИнформацияОКассовойСмене;
	
	//Информация О ККТ
	ИнформацияККТ= АТОЛСревер.ИнформацияОККТ(ПараметрыАТОЛ);
	ПараметрыАТОЛ.Вставить("ИнформацияККТ", ИнформацияККТ);
	
	
	//ОПЛАТА
	ПолучитьТЗКОплате= Документы.ЗаказНаДоставкуКлиенту.ПолучитьТЗКОплате(ЗаказНаДоставку);
	
	Если ПолучитьТЗКОплате.Количество() = 0 Тогда
		Ответ= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "У клиента нет долгов по оплате!");
		Возврат Ответ;
	КонецЕсли;      
	
	НачатьТранзакцию();
	
	Для Каждого стрОплаты Из ПолучитьТЗКОплате Цикл
		Если ЗаказНаДоставку.ОплатаБанковскойКартой Тогда 
			ДокументОплаты = СоздатьЭквайринговуюОперацию(ЗаказНаДоставку, стрОплаты.ЗаказКлиента, Сотрудник, Отказ);
		Иначе
			ДокументОплаты = СоздатьПКО(ЗаказНаДоставку, стрОплаты.ЗаказКлиента, Сотрудник, Отказ);
		КонецЕсли;
		
		//Листы согласования
		Попытка
			//Оплатим Лист согласования
			ВыборкаЛистовСогласования= ЛистыСогласованияСервер.ПолучитьЛистыСогласования(стрОплаты.ЗаказКлиента);
			СуммаОплатыПоЛистам= СуммаОплаты;
			Пока ВыборкаЛистовСогласования.Следующий() Цикл
				Если ВыборкаЛистовСогласования.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда
					ЛистСогласования= ВыборкаЛистовСогласования.Ссылка.ПолучитьОбъект();
					ЛистСогласования.СуммаОплаты= Мин(ЛистСогласования.СуммаСогласования, СуммаОплатыПоЛистам);
					Если ЛистСогласования.СуммаСогласования = ЛистСогласования.СуммаОплаты Тогда
						ЛистСогласования.Исполнен= Истина;
						ЛистСогласования.Исполнитель= Пользователи.ТекущийПользователь();
						СуммаОплатыПоЛистам= СуммаОплатыПоЛистам-ЛистСогласования.СуммаОплаты;
					КонецЕсли;
					ЛистСогласования.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			КонецЦикла;
		Исключение
			Текст= "Не удалось исполнить лист согласования на задолженность";
			ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителейОплата", УровеньЖурналаРегистрации.Ошибка, , , Текст);
			ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Сотрудник, Текст, );
			Отказ= Истина;
		КонецПопытки;
		
		//Создаим лист на доставку по звонку//изменить на "Деньги в пути"
		Попытка
			ЛистДоставкаПоЗвонку = Документы.ЛистСогласования.СоздатьДокумент();
			Документы.ЛистСогласования.ЗаполнитьДанныеПоОснованию(стрОплаты.ЗаказКлиента, ЛистДоставкаПоЗвонку, Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления);
			//ЛистДоставкаПоЗвонку.Согласовано = ЛистыСогласованияСервер.ПолучитьСогласователя(ЛистДоставкаПоЗвонку.Подразделение.Родитель);
			//ЛистДоставкаПоЗвонку.Согласован = Истина;
			ЛистДоставкаПоЗвонку.Проблема = Справочники.Проблемы.НайтиПоКоду("000000001");//Доставка по звонку//изменить на "Деньги в пути"
			ЛистДоставкаПоЗвонку.Комментарий = "Доставка с оплатой ч/з мобильное приложение";
			ЛистДоставкаПоЗвонку.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления;
			ЛистДоставкаПоЗвонку.ОсновнойМенеджер = ЗаказНаДоставку.Автор;
			ЛистДоставкаПоЗвонку.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Текст= "Не удалось создать лист согласования: Доставка";
			ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителейОплата", УровеньЖурналаРегистрации.Ошибка, , , Текст + " " + ОписаниеОшибки());
			ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Сотрудник, Текст,
			);
			Отказ= Истина;
		КонецПопытки;
		
		//-
		Если Не Отказ Тогда
			ЗафиксироватьТранзакцию();
			
			//пробитие чека
			ПараметрыАТОЛ.ДокументПродажи= стрОплаты.ЗаказКлиента;
			ПараметрыАТОЛ.ДокументОплаты= ДокументОплаты;
			
			Ответ= ПробитьЧек(ПараметрыАТОЛ, Сотрудник, Отказ);
			
			//Проверить пробит ли чек
			Если Ответ.Ошибка Тогда
				Текст= Ответ.ТекстСообщения;
				ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителейОплата", УровеньЖурналаРегистрации.Ошибка, , , Текст);
				ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Сотрудник, "Оплата по данному документу уже была произведена", );
				Отказ= Истина;
			КонецЕсли;
			УИД= Ответ.Данные.uuid;
			Ответ= АТОЛСревер.РезультатПробитияЧека(ПараметрыАТОЛ, УИД);
			
			Если Не Ответ.Ошибка Тогда
				ДанныеФН= Ответ.Данные;
				//ЗаписатьФискальнуюОперацию
				ПараметрыФискализации= АТОЛСревер.ПодготовитьДанныеФискализацииЧека(ПараметрыАТОЛ, ДанныеФН);
				МенеджерОборудованияВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
				
				ДанныеQR= АТОЛСревер.ПолучитьФНДанныеДляQRКода(ПараметрыАТОЛ, ДанныеФН);
				ОтветHTTP= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь, "Чек пробит", ДанныеQR);
				
				
				Возврат ОтветHTTP;
			Иначе
				Текст= Ответ.ТекстСообщения;
				ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , Ответ.ТекстСообщения, Текст);
				ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Сотрудник, Текст, Ответ.ТекстСообщения);
				
				ОтветHTTP= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, Текст, Ответ.Данные);
				
				ОтменитьТранзакцию();
				
				Возврат ОтветHTTP;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	//Если Не Отказ Тогда 
	//	ОтветHTTP= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Ложь, "Чек пробит");
	//	ЗафиксироватьТранзакцию();
	Если Отказ Тогда 
		ОтветHTTP= ОбщийHTTPСервер.ПодготовитьHTTPОтвет(Истина, "Чек не пробит");
		ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Сотрудник, "Отмена транзакции оплаты", );
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Возврат ОтветHTTP;

КонецФункции

#КонецОбласти

#Область Оплата
Функция СоздатьЭквайринговуюОперацию(ЗаказНаДоставку, ДокПродажи, Сотрудник, Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	//Эквайринг= ПолучитьЭквайринговуюОперацию(Заказ);
	
	Попытка
		Док= Документы.ОперацияПоПлатежнойКарте.СоздатьДокумент();
		Док.Заполнить(ДокПродажи);
		Док.Дата= ТекущаяДата();
		Док.НомерПлатежнойКарты= "0101";
		Док.ЭквайринговыйТерминал= ДокПродажи.Подразделение.ЭквайринговыйТерминалДоставка;
		Док.Комментарий= "Создан из мобильного приложения";
		Док.Записать(РежимЗаписиДокумента.Проведение);
		//Док.Записать(РежимЗаписиДокумента.Запись);
		
	Исключение
		
		Отказ= Истина;
		Текст= "Не удалось создать Эквайринговую операцию на оплату по "+ЗаказНаДоставку.Ссылка;
		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Сотрудник, Текст, ИнформацияОбОшибке().Описание);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Док.Ссылка;
	
КонецФункции

Функция СоздатьПКО(ЗаказНаДоставку, ДокПродажи, Сотрудник, Отказ)
	Попытка
		Док= Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
		Док.Дата= ТекущаяДата();
				
		Док.Заполнить(ДокПродажи);
		
		Док.Касса= ДокПродажи.Подразделение.КассаДоставка;
		Док.Комментарий= "Создан из мобильного приложения";
		
		Док.Записать(РежимЗаписиДокумента.Проведение);
		//Док.Записать(РежимЗаписиДокумента.Запись);
		
	Исключение
		
		Отказ= Истина;
		Текст= "Не удалось создать ПКО на оплату по "+ЗаказНаДоставку.Ссылка;
		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Сотрудник, Текст, ИнформацияОбОшибке().Описание);
	КонецПопытки;
	
	Возврат Док.Ссылка;
КонецФункции

Функция ПробитьЧек(ПараметрыАТОЛ, Сотрудник, Отказ)
	Попытка
		Ответ= АТОЛСревер.ПробитьЧек(ПараметрыАТОЛ);
	Исключение
		
		Отказ= Истина;
		Текст= "Не удалось пробить чек";
		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		ОбменСМобильнымПриложениемВодителейСервер.ЗарегестрироватьОшибку(Сотрудник, Текст, ИнформацияОбОшибке().Описание);
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции


#КонецОбласти


#Область Вспомогательные
Функция ПолучитьМетод(Запрос)
	ОтносительныйURL= Запрос.ОтносительныйURL;
	
	//URL= "mobiledrivers";
	//Нач= СтрНайти(ОтносительныйURL, URL);
	//Метод= Прав(ОтносительныйURL, СтрДлина(ОтносительныйURL)-Нач-СтрДлина(URL));
	
	Возврат ОтносительныйURL;
КонецФункции

Функция ОтправитьКодПодтверждения(НомерТелефона)
	УстановитьПривилегированныйРежим(Истина);
	//Формируем случайный код
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = Формат(ГСЧ.СлучайноеЧисло(100, 999),"ЧГ = '0'");  
	КодОтправленный = Строка(СлучайноеЧисло);
	
	//Отправляем СМС с кодом
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона);
	НомераТелефонов = Новый Массив;
	НомераТелефонов.Добавить("+7"+НомерТелефона);
	ТекстСообщения = "Код для регистрации мобильного клиента " + КодОтправленный;
	
	РезультатОтправки = ОтправкаSMS.ОтправитьSMS(НомераТелефонов,ТекстСообщения,,);
	
	Возврат КодОтправленный;
КонецФункции
#КонецОбласти
